DataProcessors/ТестовоеЗаполнениеНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>ТестовоеЗаполнениеНоменклатуры</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Enums/ЕдиницыИзмирения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ЕдиницыИзмирения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Кг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Л</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Шт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмирения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмирения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентНаценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШтрихКод</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>30</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазваниеНаЭтикетке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФОП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФискальнаПродажа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УКТЗЕТ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ШтрихКоды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ШтрихКод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипШтрихКода</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыШтрихКодов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ТестовоеЗаполнениеНоменклатуры/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьТестовуюНоменклатуру(Количество);
КонецПроцедуры       


// Модуль для тестового заполнения справочника Номенклатура

&НаСервере
Процедура ЗаполнитьТестовуюНоменклатуру(Количество = 10) Экспорт
    // Создаёт тестовые элементы справочника "Номенклатура" со всеми реквизитами
    // Параметр: Количество — число элементов для создания (по умолчанию 10)
    
    Если ЗначениеЗаполнено(Количество) = Ложь Тогда
        Количество = 10;
    КонецЕсли;
    
    МД = Метаданные.Справочники.Номенклатура;
    СчётУспешно = 0;
    СчётОшибок = 0;
    
    Для Сч = 1 По Количество Цикл
        Попытка
            Элемент = Справочники.Номенклатура.СоздатьЭлемент();
            
            // Обязательные стандартные реквизиты
            Элемент.Код = Сч;
            Элемент.Наименование = "Тестовая номенклатура №" + Формат(Сч, "ЧГ=0");
            
            // Заполнение пользовательских реквизитов
            ЗаполнитьРеквизитыЭлемента(Элемент, Сч);
            
            // Заполнение табличных частей
            ЗаполнитьТабличныеЧасти(Элемент, Сч);
            
            Элемент.Записать();
            СчётУспешно = СчётУспешно + 1;
            
        Исключение
            СчётОшибок = СчётОшибок + 1;
            Сообщить("Ошибка при создании номенклатуры №" + Формат(Сч, "ЧГ=0") + 
                ": " + ОписаниеОшибки());
        КонецПопытки;
    КонецЦикла;
    
    Сообщить("Заполнение завершено. Успешно: " + Формат(СчётУспешно, "ЧГ=0") + 
        ", ошибок: " + Формат(СчётОшибок, "ЧГ=0"));
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыЭлемента(Элемент, НомерЭлемента) Экспорт
    // Заполняет все доступные реквизиты элемента номенклатуры
    
    // ЕдиницаИзмирения - перечисление (Кг, Л, Шт)
    Попытка
        ЕдиницыИзмер = Новый Массив(3);
        ЕдиницыИзмер[0] = Перечисления.ЕдиницыИзмирения.Кг;
        ЕдиницыИзмер[1] = Перечисления.ЕдиницыИзмирения.Л;
        ЕдиницыИзмер[2] = Перечисления.ЕдиницыИзмирения.Шт;
        
        ИндексЕд = (НомерЭлемента - 1) % 3;
        Элемент.ЕдиницаИзмирения = ЕдиницыИзмер[ИндексЕд];
    Исключение
    КонецПопытки;
    
    // ПроцентНаценки - число
    Попытка
        Элемент.ПроцентНаценки = 10 + НомерЭлемента;
    Исключение
    КонецПопытки;
    
    // ШтрихКод - число
    Попытка
        Элемент.ШтрихКод = 4600000000000 + НомерЭлемента;
    Исключение
    КонецПопытки;
    
    // НазваниеНаЭтикетке - строка
    Попытка
        Элемент.НазваниеНаЭтикетке = "Этикетка №" + Формат(НомерЭлемента, "ЧГ=0");
    Исключение
    КонецПопытки;
    
    // ФОП - ссылка на Организации (опционально, если существует организация)
    Попытка
        КодОрг = (НомерЭлемента - 1) % 3 + 1;
        ОргСпи = Справочники.Организации.НайтиПоКоду(КодОрг);
        Если ЗначениеЗаполнено(ОргСпи) Тогда
            Элемент.ФОП = ОргСпи;
        КонецЕсли;
    Исключение
    КонецПопытки;
    
    // ФискальнаПродажа - булево
    Попытка
        Элемент.ФискальнаПродажа = ?(НомерЭлемента % 2 = 0, Истина, Ложь);
    Исключение
    КонецПопытки;
    
    // НалоговаяГруппа - ссылка на НалоговыеГруппы (опционально)
    Попытка
        КодНГ = (НомерЭлемента - 1) % 3 + 1;
        НГСпи = Справочники.НалоговыеГруппы.НайтиПоКоду(КодНГ);
        Если ЗначениеЗаполнено(НГСпи) Тогда
            Элемент.НалоговаяГруппа = НГСпи;
        КонецЕсли;
    Исключение
    КонецПопытки;
    
    // УКТЗЕТ - число
    Попытка
        Элемент.УКТЗЕТ = 10100000 + НомерЭлемента;
    Исключение
    КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличныеЧасти(Элемент, НомерЭлемента) Экспорт
    // Заполняет табличные части элемента
    
    // Табличная часть "ШтрихКоды"
    Попытка
        ШтрихКодыТаблица = Элемент.ШтрихКоды;
        
        // Добавляем несколько вариантов штрих-кодов
        НовСтр = ШтрихКодыТаблица.Добавить();
        НовСтр.ШтрихКод = "4600000000001" + Формат(НомерЭлемента, "ЧГ=0");
        Попытка
            НовСтр.ТипШтрихКода = Перечисления.ТипыШтрихКодов.EAN13;
        Исключение
        КонецПопытки;
        
        НовСтр = ШтрихКодыТаблица.Добавить();
        НовСтр.ШтрихКод = "460" + Формат(НомерЭлемента, "ЧГ=0000000000");
        Попытка
            НовСтр.ТипШтрихКода = Перечисления.ТипыШтрихКодов.Code128;
        Исключение
        КонецПопытки;
        
    Исключение
    КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура ПоказатьРеквизитыНоменклатуры() Экспорт
    // Выводит полный список реквизитов и табличных частей справочника Номенклатура
    
    МД = Метаданные.Справочники.Номенклатура;
    Текст = "=== РЕКВИЗИТЫ СПРАВОЧНИКА НОМЕНКЛАТУРА ===" + Символ(13) + Символ(10);
    
    Текст = Текст + Символ(13) + "--- Стандартные реквизиты ---" + Символ(13) + Символ(10);
    Для Каждого Рекв Из МД.СтандартныеРеквизиты Цикл
        Текст = Текст + Рекв.Имя + Символ(13) + Символ(10);
    КонецЦикла;
    
    Текст = Текст + Символ(13) + "--- Пользовательские реквизиты ---" + Символ(13) + Символ(10);
    Для Каждого Рекв Из МД.Реквизиты Цикл
        Текст = Текст + Рекв.Имя + " (" + Рекв.Тип + ")" + Символ(13) + Символ(10);
    КонецЦикла;
    
    Текст = Текст + Символ(13) + "=== ТАБЛИЧНЫЕ ЧАСТИ ===" + Символ(13) + Символ(10);
    Для Каждого ТЧ Из МД.ТабличныеЧасти Цикл
        Текст = Текст + Символ(13) + "Таблица: " + ТЧ.Имя + Символ(13) + Символ(10);
        Для Каждого Поле Из ТЧ.Реквизиты Цикл
            Текст = Текст + "  - " + Поле.Имя + " (" + Поле.Тип + ")" + Символ(13) + Символ(10);
        КонецЦикла;
    КонецЦикла;
    
    Сообщить(Текст);
КонецПроцедуры

&НаСервере
Процедура УдалитьТестовуюНоменклатуру() Экспорт
    // Удаляет все элементы номенклатуры, созданные для тестирования
    // (имеющие наименование начиная с "Тестовая номенклатура")
    
    Запрос = Новый Запрос();
    Запрос.Текст = 
        "ВЫБРАТЬ
        |	Номенклатура.Ссылка
        |ИЗ
        |	Справочник.Номенклатура КАК Номенклатура
        |ГДЕ
        |	Номенклатура.Наименование ПОДОБНО ""Тестовая номенклатура%""";
    
    РезВыб = Запрос.Выполнить().Выбрать();
    СчётУдалено = 0;
    
    Пока РезВыб.Следующий() Цикл
        Попытка
            Объект = РезВыб.Ссылка.ПолучитьОбъект();
            Объект.Удалить();
            СчётУдалено = СчётУдалено + 1;
        Исключение
            Сообщить("Ошибка при удалении: " + ОписаниеОшибки());
        КонецПопытки;
    КонецЦикла;
    
    Сообщить("Удалено тестовых элементов: " + Формат(СчётУдалено, "ЧГ=0"));
КонецПроцедуры
